{
    "language": "Sprache",
    "language.de": "Deutsch",
    "language.en": "Englisch",
    "language.jpn": "Japanisch",
    "menu.home": "Startseite",
    "menu.stats": "Statistiken",
    "menu.portfolio": "Portfolio",
    "menu.projects": "Projekte",
    "menu.skills": "Fähigkeiten",
    "menu.about": "Über mich",
    "menu.contact": "Kontakt",
    "menu.mangadb": "MangaDB",
    "menu.achievements": "Erfolge",
    "menu.all-projects": "Alle Projekte",
    "profile.location": "Wien, Österreich",
    "profile.description": "Ich bin ein {age} Jahre alter Programmierer. Ich habe letztes Jahr meine Matura an der HTL Donaustadt abgeschlossen und begeistere mich für Web Development.",
    "profile.journey-start.title": "Beginn meiner Reise",
    "profile.journey-start.desc": "Mit 15 entdeckte ich meine Leidenschaft für HTML und CSS und erstellte meine erste eigene Website. Wenige Monate später stand ich vor der Entscheidung, nach Abschluss der Pflichtschule entweder am Gymnasium zu bleiben oder eine andere Schulrichtung einzuschlagen. Anfangs wollte ich am Gymnasium bleiben, doch meine Mutter, die mein großes Interesse an Computern und Programmierung erkannte, überzeugte mich, an die HTL Donaustadt in die Informatikabteilung zu wechseln (Was im nachhinein die beste Entscheidung war).",
    "profile.htl-donaustadt.title": "HTL Donaustadt",
    "profile.htl-donaustadt.desc": "An der HTL Donaustadt verbrachte ich fünf Jahre, in denen ich nicht nur zahlreiche neue Technologien wie C#, Java und NodeJS erlernte, sondern auch an Wettbewerben wie dem Cloudflight Coding Contest und dem ATOS HTL Hackathon teilnahm – letzteren konnte ich mit meinem Team auf dem ersten Platz abschließen. Im letzten Jahr meiner Ausbildung widmete ich mich meiner Diplomarbeit zum Thema „Performantes Rendern von 3D-Objekten“ und schloss die HTL mit ausgezeichnetem Erfolg ab.",
    "profile.current.title": "Zivildienst",
    "profile.current.desc":"Derzeit absolviere ich meinen Zivildienst, den ich Ende Dezember abschließen werde.",
    "project.view": "Öffnen",
    "project.source": "Quellcode",
    "project.more": "Mehr...",
    "project.description.mandelbrot": "Simpler Mandelbrot Explorer in Echtzeit.",
    "project.description.picross": "Ein Klon des populären Spiels 'Picross' im Browser.",
    "project.description.vertex": "Ein Klon des Spiels 'Vertex Game' (New York Times) im Browser.",
    "project.description.lego": "Ein Tool um im Browser Lego zu bauen.",
    "project.description.mangadb": "Fullstack Web-App um seinen Manga-Sammlung zu verwalten oder um die neuesten Bände im Blick zu behalten.",
    "project.mangadb.homepage": "Startseite",
    "project.mangadb.settings": "Einstellungen",
    "project.mangadb.series": "Serien-Seite",
    "project.mangadb.volume": "Band-Seite",
    "project.mangadb.3d-view": "3D-Ansicht",
    "project.description.mangadb.full": "MangaDB ist mein größtes und ambitioniertestes Projekt – eine Fullstack-Anwendung, die es Manga-Fans ermöglicht, ihre Sammlungen zu verwalten und neue Titel zu entdecken. Das Frontend basiert auf Vue.js, während das Backend mit Node.js und Express realisiert wurde. Für die Datenverwaltung kommt eine MySQL-Datenbank zum Einsatz, die eine effiziente und skalierbare Speicherung von Nutzerdaten und Manga-Informationen ermöglicht.",
    "project.description.mangadb.homepage": "Die App zeigt die Top 10 der meistgesuchten Serien des letzten Monats, die zuletzt hinzugefügten Serien und Bände sowie die nächsten Veröffentlichungen. Alle Informationen zu Serien, Bänden und Co. werden standardmäßig in der Sprache des Nutzers geladen. Optional kann der Nutzer jedoch entscheiden, Inhalte wie Cover oder Beschreibungen aus einer anderen Ausgabe (z. B. der englischen) anzuzeigen, sofern diese verfügbar ist. Wenn die Inhalte weder in der Sprache des Nutzers noch in der anderen Ausgabe verfügbar sind, werden die Inhalte in der Sprache des Ursprungs der Serie/Band angezeigt.",
    "project.description.mangadb.series": "Die Serien-Seite von MangaDB bietet umfassende Informationen zu jeder Serie und ihren Bänden. Eine Serie enthält Beschreibungen, eine Liste der Mitwirkenden (z. B. Autor, Zeichner, Character Designer), den Herausgeber, den Titel und natürlich eine Übersicht aller Bände in verschiedenen Sprachen. <br><br> Zusätzlich zeigt die Seite Beziehungen zwischen Serien wie Spin-Offs, Sequels und Prequels. Falls vorhanden, werden auch Sonderausgaben in der jeweiligen Sprache, wie Collectors Editions, angezeigt. Die Seite bietet damit eine zentrale Anlaufstelle für alle relevanten Informationen zu Manga-Serien und ihren Veröffentlichungen.",
    "project.description.mangadb.volume": "Die Band-Seite von MangaDB bietet detaillierte Informationen zu jedem Manga-Band. Neben grundlegenden Daten wie ISBN, Veröffentlichungsdatum, Abmessungen, Sprache, Seitenanzahl, Format und Altersfreigabe gibt es eine besondere Funktion: <br><br> Der Band kann in 3D angezeigt werden, sofern die Abmessungen sowie die Bilder der Rückseite und des Buchrückens im System verfügbar sind. Diese Funktion ermöglicht es Nutzern, den Band virtuell zu erleben und sich einen realistischen Eindruck davon zu verschaffen.",
    "project.description.mangadb.end": "Auf alle Features im Detail einzugehen, würde zu lange dauern deshalb hier eine kleine Aufzählung an allen Funktionen:",
    "mangadb.features.frontend": "Frontend",
    "mangadb.features.list-management": "Listen-Verwaltung",
    "mangadb.features.collection-management": "Sammlungs-Verwaltung",
    "mangadb.features.administration": "Administration",
    "mangadb.features.user-management": "Benutzer-Verwaltung",
    "mangadb.features.tag-management": "Tag-Verwaltung",
    "mangadb.features.series-management": "Serien-Verwaltung",
    "mangadb.features.volume-management": "Band-Verwaltung",
    "mangadb.features.publisher-management": "Herausgeber-Verwaltung",
    "mangadb.features.contributor-management": "Mitwirkende-Verwaltung",
    "mangadb.features.backend": "Backend",
    "mangadb.features.image-compression": "Bild-Komprimierung",
    "mangadb.features.caching": "Caching",
    "volumes": "Bände",
    "series": "Serien",
    "publisher": "Herausgeber",
    "contributors": "Mitwirkende",
    "contact.name": "Name",
    "contact.email": "Email",
    "contact.description": "Beschreibung",
    "contact.submit": "Abschicken",
    "achievements.atos": "Im Rahmen eines 3-tägigen Events konnte ich zusammen mit meinen Kollegen Leo Müller, Fabian Hohn, Alexander Donner, Patrick Kristen eine Idee / einen Prototypen zum Thema “Nachhaltigkeit” entwickeln. Unsere Idee war die Salzstreuung zu optimieren und dies haben wir durch eine Web Applikation mit simulierten Daten erreicht. Mit diesem Prototypen haben wir den 1. Platz erreicht.",
    "achievements.ccc-2021": "Beim Cloudflight Coding Contest 2021 konnte ich zusammen mit meinem Kollegen Leo Müller den 4. Platz im #School Contest und den 27. Platz im #Classic Contest erreichen.",
    "achievements.ccc-2022": "Beim Cloudflight Coding Contest 2022 konnte ich zusammen mit meinem Kollegen Martin Schindler den 3. Platz im #School Contest und den 36. Platz im #Classic Contest erreichen."
}