{
    "language": "Language",
    "language.de": "German",
    "language.en": "English",
    "language.jpn": "Japanese",
    "menu.home": "Home",
    "menu.stats": "Statistics",
    "menu.portfolio": "Portfolio",
    "menu.projects": "Projects",
    "menu.skills": "Skills",
    "menu.about": "About Me",
    "menu.contact": "Contact",
    "menu.mangadb": "MangaDB",
    "menu.achievements": "Achievements",
    "menu.all-projects": "All Projects",
    "profile.location": "Vienna, Austria",
    "profile.description": "I'm an {age} year old programmer. I graduated from HTL Donaustadt last year and am passionate about web development.",
    "profile.journey-start.title": "Start of my journey",
    "profile.journey-start.desc": "When I was 15, I discovered my passion for HTML and CSS and created my first website. A few months later, I was faced with the decision of either staying at grammar school after finishing compulsory school or going to a different school. Initially, I wanted to stay at grammar school, but my mother, who recognised my great interest in computers and programming, convinced me to switch to the computer science department at HTL Donaustadt (which was the best decision in hindsight).",
    "profile.htl-donaustadt.title": "HTL Donaustadt",
    "profile.htl-donaustadt.desc": "I then spent 5 years at the HTL Donaustadt and not only learnt numerous new technologies such as C#, Java or NodeJS during my training, but also took part in several competitions such as the Cloudflight Coding Contest or the ATOS HTL Hackathon, where I achieved first place with my team. In the last year, I was able to work on my diploma thesis on the topic of ‘Performant rendering of 3D objects’ and graduated from the HTL with an excellent result.",
    "profile.current.title": "Civilian service",
    "profile.current.desc":"I am currently doing my community service, which I will complete at the end of December.",
    "project.view": "View",
    "project.source": "Source",
    "project.more": "More...",
    "project.description.mandelbrot": "Simple Mandelbrot Explorer in real time.",
    "project.description.picross": "A clone of the popular game 'Picross' in the browser.",
    "project.description.vertex": "A clone of the game 'Vertex Game' (New York Times) in the browser.",
    "project.description.lego": "A tool to build lego models in the browser.",
    "project.description.mangadb": "Fullstack web app to manage your manga collection or keep track of your favorite manga.",
    "project.mangadb.homepage": "Homepage",
    "project.mangadb.settings": "Settings",
    "project.mangadb.series": "Series-Page",
    "project.mangadb.volume": "Volume-Page",
    "project.mangadb.3d-view": "3D-View",
    "project.description.mangadb.full": "MangaDB is my biggest and most ambitious project - a fullstack application that allows manga fans to manage their collections and discover new titles. The frontend is based on Vue.js, while the backend was realized with Node.js and Express. A MySQL database is used for data management, which enables efficient and scalable storage of user data and manga information.",
    "project.description.mangadb.homepage": "The app shows the top 10 most searched series of the last month, the most recently added series and volumes as well as the next releases. All information on series, volumes and co. is loaded in the user's language by default. However, the user can optionally decide to display content such as covers or descriptions from a different edition (e.g. English) if this is available. If the content is neither available in the user's language nor in the other edition, the content is displayed in the language of the series/volume's origin.",
    "project.description.mangadb.series": "The series page of MangaDB offers comprehensive information on each series and its volumes. A series contains descriptions, a list of contributors (e.g. author, illustrator, character designer), the publisher, the title and, of course, an overview of all volumes in various languages. <br><br> The page also shows relationships between series such as spin-offs, sequels and prequels. If available, special editions in the respective language, such as Collectors Editions, are also displayed. The site thus offers a central point of contact for all relevant information on manga series and their releases.",
    "project.description.mangadb.volume": "The MangaDB volume page offers detailed information on each volume. In addition to basic data such as ISBN, publication date, dimensions, language, number of pages, format and age rating, there is a special function: <br><br> The volume can be displayed in 3D if the dimensions and images of the back and spine are available in the system. This function allows users to experience the volume virtually and get a realistic impression of it.",
    "project.description.mangadb.end": "To go into all the features in detail would take too long, so here is a short list of all the functions:",
    "mangadb.features.frontend": "Frontend",
    "mangadb.features.list-management": "List-Management",
    "mangadb.features.collection-management": "Collection-Management",
    "mangadb.features.administration": "Administration",
    "mangadb.features.user-management": "User-Management",
    "mangadb.features.tag-management": "Tag-Management",
    "mangadb.features.series-management": "Series-Management",
    "mangadb.features.volume-management": "Volume-Management",
    "mangadb.features.publisher-management": "Publisher-Management",
    "mangadb.features.contributor-management": "Contributor-Management",
    "mangadb.features.backend": "Backend",
    "mangadb.features.image-compression": "Image-Compression",
    "mangadb.features.caching": "Caching",
    "volumes": "Volumes",
    "series": "Series",
    "publisher": "Publishers",
    "contributors": "Contributors",
    "contact.name": "Name",
    "contact.email": "Email",
    "contact.description": "Descriptions",
    "contact.submit": "Submit",
    "achievements.atos": "As part of a 3-day event, my colleagues Leo Müller, Fabian Hohn, Alexander Donner and Patrick Kristen and I were able to develop an idea/prototype on the topic of “sustainability”. Our idea was to optimize salt spreading and we achieved this through a web application with simulated data. We achieved 1st place with this prototype.",
    "achievements.ccc-2021": "At the Cloudflight Coding Contest 2021 I was able to achieve 4th place in the #School Contest and 27th place in the #Classic Contest together with my colleague Leo Müller.",
    "achievements.ccc-2022": "At the Cloudflight Coding Contest 2022, I was able to achieve 3rd place in the #School Contest and 36th place in the #Classic Contest together with my colleague “Martin Schindler”."
}